# TODO  Напишите функцию count_letters
def smallkol(text):
    count1 = 0
    for bukva in list(text):
        if bukva.isalpha():
            count1 += 1
    return count1
import collections
def charactersCount(text, kolvo):
    count = collections.Counter()
    kount = collections.Counter()
    for char in list(text):
        count[char] += 1
        kount[char] += count[char]/kolvo
    kount = dict(kount)
    return kolvo, kount

main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""
lower_ = list(filter(lambda x: x.islower(),list(main_str)))


print(charactersCount(lower_, smallkol(lower_)))

